base_payload = {
    "招标人": {
        "项目名称": "会泽县冷链物流园区学校食堂食材配送中心蔬菜冷库设备及工程施工安装采购项目（二次）",
        "标段名称": "会泽县冷链物流园区学校食堂食材配送中心蔬菜冷库设备及工程施工安装采购项目（二次）",
        "项目编号": "YNZFCG2021-02",
        "招标单位名称": "会泽县道成扶贫开发投资经营管理有限公司",
        "项目预算": "5500000",
        "名称": "会泽县道成扶贫开发投资经营管理有限公司",
        "工期": "空",
        "工程质量": "空",
        "补充说明": "空",
        "投标保证金": "",
        "代理机构名称": "云南帜丰招标有限公司"
    },
    "标书类型": "工程类",
    "上一任务编号": "1",
    "偏离表": {
        "file_list": [],
        "requirement_list": "空"
    },
    "投标人": {
        "法定代表人": "空",
        "授权委托人": "",
        "统一社会信用码": None,
        "注册资金": None,
        "公司类型": None,
        "注册地址": None,
        "注册机构": None,
        "公司邮箱": None,
        "成立日期": None,
        "登记日期": None,
        "营业截止时长": None,
        "经营范围": None,
        "名称": "测试公司",
        "地址": None,
        "网址": None,
        "电话": None,
        "传真": None,
        "邮政编码": None,
        "开户名称": None,
        "开户银行": None,
        "开户账号": None,
        "银行地址": None,
        "银行电话": None,
        "行业分类": None,
        "公司规模": None,
        "投标员工总人数": None,
        "投标高级职称人数": None,
        "投标中级职称人数": None,
        "投标初级职称人数": None,
        "投标技工人数": None,
        "投标项目经理人数": None,
        "安全生产许可证生效时间": None,
        "安全生产许可证失效时间": None,
        "填写时间": [
            "2025",
            "6",
            "30"
        ],
        "项目经理": "空"
    },
    "文档": {
        "招标解析文件": "https://intellibid-bid.oss-cn-hangzhou.aliyuncs.com/test/test_zz/2025-%E6%96%B0%E7%96%86-%E4%B8%94%E6%9C%AB%E5%8E%BF%E8%8B%B1%E5%90%BE%E6%96%AF%E5%A1%98%E4%B9%A12025%E5%B9%B4%E4%B8%AD%E5%A4%AE%E8%B4%A2%E6%94%BF%E4%BB%A5%E5%B7%A5%E4%BB%A3%E8%B5%88%E9%A1%B9%E7%9B%AE.docx?Expires=1751359887&OSSAccessKeyId=TMP.3Kqv6hw8hWkkfQZpzkyogNFG61KP3HgPu66ZzHKRhctR4SK1SC3v42SzvbQTiXzGBX58mnNtsm4f1e2uJr7SZHXPEGM9FL&Signature=XPe4hRsWYaauxYwPMalrUduzdaQ%3D",
        "营业执照": "空",
        "审计报告": "空",
        "招标文件": "https://intellibid-bid.oss-cn-hangzhou.aliyuncs.com/test/file1749180142161.docx?Expires=1751367274&OSSAccessKeyId=TMP.3KrT4yqwomdmxDLFoK1nJW2oP27Cx4qBxhQZiLBK3hL5SDRJ1r7kJieMMvu38wwaJPsTH4qz8ZahGN9YqgsawxBxxoSeE5&Signature=7c%2FrhashnkfUIRSVkW9fcgt%2FCug%3D",
        "开户文件": "",
        "法人身份证": [],
        "授权委托人身份证": [],
        "企业业绩": [
            {
                "采购单位": "中国石油",
                "项目名称": "中国石油项目第一期",
                "项目金额": 1000.0,
                "项目开工时间": "2019-01-01",
                "项目竣工时间": "2020-12-31",
                "项目负责人": "张三",
                "采购单位联系人": "赵一",
                "竣工备案": "132213",
                "中标结果通知书": "",
                "合同委托书": "",
                "施工许可证": "",
                "验收报告": ""
            },
            {
                "采购单位": "中国石化",
                "项目名称": "中国石油项目第二期",
                "项目金额": 500.0,
                "项目开工时间": "2021-01-01",
                "项目竣工时间": "2022-12-31",
                "项目负责人": "李四",
                "采购单位联系人": "钱二",
                "竣工备案": "138001",
                "中标结果通知书": "",
                "合同委托书": "",
                "施工许可证": "",
                "验收报告": ""
            }
        ],
        "企业财务信息": "",
        "企业证书": "",
        "人员信息": {
            "项目负责人": {
                "人员姓名": "张三",
                "人员职位": "总经理",
                "性别": "男",
                "身份证号": "311111198602132222",
                "联系电话": "13800138000",
                "人员类型": "岗位类",
                "身份证": [],
                "社保材料": [],
                "证书材料": [],
                "劳动合同": []
            },
            "技术负责人": {
                "人员姓名": "李四",
                "人员职位": "普通员工",
                "性别": "男",
                "身份证号": "311111199502132222",
                "联系电话": "13800138111",
                "人员类型": "岗位类",
                "身份证": [],
                "社保材料": [],
                "证书材料": [],
                "劳动合同": []
            },
            "施工负责人": {
                "人员姓名": "王五",
                "人员职位": "普通员工",
                "性别": "男",
                "身份证号": "311111200002132222",
                "联系电话": "13800138222",
                "人员类型": "岗位类",
                "身份证": [],
                "社保材料": [],
                "证书材料": [],
                "劳动合同": []
            },
            "设计负责人": ""
        },
        "需要填充": "True"
    },
    "目录": {
        "完整目录": [
            {
                "name": "投标函",
                "parentid": "0",
                "id": "1",
                "children": [
                    {
                        "name": "投标函",
                        "parentid": "1",
                        "id": "1-1"
                    },
                    {
                        "name": "投标保证书",
                        "parentid": "1",
                        "id": "1-2"
                    }
                ]
            },
            {
                "name": "投标报价（唱标）一览表",
                "parentid": "0",
                "id": "2"
            },
            {
                "name": "产品质量承诺书",
                "parentid": "0",
                "id": "3",
                "children": [
                    {
                        "name": "产品质量承诺书",
                        "parentid": "3",
                        "id": "3-1"
                    },
                    {
                        "name": "售后服务及承诺",
                        "parentid": "3",
                        "id": "3-2"
                    }
                ]
            },
            {
                "name": "投标人资格及资信证明文件",
                "parentid": "0",
                "id": "4"
            },
            {
                "name": "法定代表人证明书格式",
                "parentid": "0",
                "id": "5",
                "children": [
                    {
                        "name": "法定代表人证明书格式",
                        "parentid": "5",
                        "id": "5-1"
                    },
                    {
                        "name": "法定代表人授权书格式",
                        "parentid": "5",
                        "id": "5-2"
                    }
                ]
            },
            {
                "name": "投标人基本情况表（企业简介）",
                "parentid": "0",
                "id": "6",
                "children": [
                    {
                        "name": "投标人基本情况表（企业简介）",
                        "parentid": "6",
                        "id": "6-1"
                    },
                    {
                        "name": "财务状况表",
                        "parentid": "6",
                        "id": "6-2"
                    }
                ]
            },
            {
                "name": "财务状况表",
                "parentid": "0",
                "id": "7",
                "children": [
                    {
                        "name": "财务状况表",
                        "parentid": "7",
                        "id": "7-1"
                    },
                    {
                        "name": "投标人类似项目采购中标情况表",
                        "parentid": "7",
                        "id": "7-2"
                    }
                ]
            },
            {
                "name": "投标人认为需要的其他资料",
                "parentid": "0",
                "id": "8",
                "children": [
                    {
                        "name": "投标人认为需要的其他资料",
                        "parentid": "8",
                        "id": "8-1"
                    },
                    {
                        "name": "承诺书",
                        "parentid": "8",
                        "id": "8-2"
                    }
                ]
            },
            {
                "name": "承诺书",
                "parentid": "0",
                "id": "9"
            }
        ]
    }
}

API_URL = "http://192.168.0.87:5005"
